In [2]:
import pandas as pd
import numpy as np
import pandas_datareader.data as web
all_data = {ticker:web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [4]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [7]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-04-04  0.001740 -0.005918 -0.005085  0.007529
2019-04-05  0.006694  0.003502  0.004440 -0.006461
2019-04-08  0.015736  0.000768  0.000334 -0.002742
2019-04-09 -0.002999 -0.008927 -0.005420 -0.005474
2019-04-10  0.005614  0.006404  0.007629  0.004101

In [10]:
returns['MSFT'].cov(returns['GOOG'])

0.00011978831294694607

In [12]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000270  0.000076  0.000107  0.000116
IBM   0.000076  0.000152  0.000087  0.000078
MSFT  0.000107  0.000087  0.000210  0.000120
GOOG  0.000116  0.000078  0.000120  0.000237

In [13]:
returns.corrwith(returns.IBM)

AAPL    0.373624
IBM     1.000000
MSFT    0.488670
GOOG    0.409038
dtype: float64

In [15]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [17]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0